MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1575/mcu.h
// Register: PWM1OF
#define PWM1OF PWM1OF
extern volatile unsigned short          PWM1OF              __at(0xD97);
#ifndef _LIB_BUILD
asm("PWM1OF equ 0D97h");
#endif

// Register: PWM1OFL
#define PWM1OFL PWM1OFL
extern volatile unsigned char           PWM1OFL             __at(0xD97);
#ifndef _LIB_BUILD
asm("PWM1OFL equ 0D97h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM1OFL0               :1;
        unsigned PWM1OFL1               :1;
        unsigned PWM1OFL2               :1;
        unsigned PWM1OFL3               :1;
        unsigned PWM1OFL4               :1;
        unsigned PWM1OFL5               :1;
        unsigned PWM1OFL6               :1;
        unsigned PWM1OFL7               :1;
    };
    struct {
        unsigned PWM1OFL                :8;
    };
} PWM1OFLbits_t;
extern volatile PWM1OFLbits_t PWM1OFLbits __at(0xD97);
// bitfield macros
#define _PWM1OFL_OF_POSN                                    0x0
#define _PWM1OFL_OF_POSITION                                0x0
#define _PWM1OFL_OF_SIZE                                    0x8
#define _PWM1OFL_OF_LENGTH                                  0x8
#define _PWM1OFL_OF_MASK                                    0xFF
#define _PWM1OFL_PWM1OFL0_POSN                              0x0
#define _PWM1OFL_PWM1OFL0_POSITION                          0x0
#define _PWM1OFL_PWM1OFL0_SIZE                              0x1
#define _PWM1OFL_PWM1OFL0_LENGTH                            0x1
#define _PWM1OFL_PWM1OFL0_MASK                              0x1
#define _PWM1OFL_PWM1OFL1_POSN                              0x1
#define _PWM1OFL_PWM1OFL1_POSITION                          0x1
#define _PWM1OFL_PWM1OFL1_SIZE                              0x1
#define _PWM1OFL_PWM1OFL1_LENGTH                            0x1
#define _PWM1OFL_PWM1OFL1_MASK                              0x2
#define _PWM1OFL_PWM1OFL2_POSN                              0x2
#define _PWM1OFL_PWM1OFL2_POSITION                          0x2
#define _PWM1OFL_PWM1OFL2_SIZE                              0x1
#define _PWM1OFL_PWM1OFL2_LENGTH                            0x1
#define _PWM1OFL_PWM1OFL2_MASK                              0x4
#define _PWM1OFL_PWM1OFL3_POSN                              0x3
#define _PWM1OFL_PWM1OFL3_POSITION                          0x3
#define _PWM1OFL_PWM1OFL3_SIZE                              0x1
#define _PWM1OFL_PWM1OFL3_LENGTH                            0x1
#define _PWM1OFL_PWM1OFL3_MASK                              0x8
#define _PWM1OFL_PWM1OFL4_POSN                              0x4
#define _PWM1OFL_PWM1OFL4_POSITION                          0x4
#define _PWM1OFL_PWM1OFL4_SIZE                              0x1
#define _PWM1OFL_PWM1OFL4_LENGTH                            0x1
#define _PWM1OFL_PWM1OFL4_MASK                              0x10
#define _PWM1OFL_PWM1OFL5_POSN                              0x5
#define _PWM1OFL_PWM1OFL5_POSITION                          0x5
#define _PWM1OFL_PWM1OFL5_SIZE                              0x1
#define _PWM1OFL_PWM1OFL5_LENGTH                            0x1
#define _PWM1OFL_PWM1OFL5_MASK                              0x20
#define _PWM1OFL_PWM1OFL6_POSN                              0x6
#define _PWM1OFL_PWM1OFL6_POSITION                          0x6
#define _PWM1OFL_PWM1OFL6_SIZE                              0x1
#define _PWM1OFL_PWM1OFL6_LENGTH                            0x1
#define _PWM1OFL_PWM1OFL6_MASK                              0x40
#define _PWM1OFL_PWM1OFL7_POSN                              0x7
#define _PWM1OFL_PWM1OFL7_POSITION                          0x7
#define _PWM1OFL_PWM1OFL7_SIZE                              0x1
#define _PWM1OFL_PWM1OFL7_LENGTH                            0x1
#define _PWM1OFL_PWM1OFL7_MASK                              0x80
#define _PWM1OFL_PWM1OFL_POSN                               0x0
#define _PWM1OFL_PWM1OFL_POSITION                           0x0
#define _PWM1OFL_PWM1OFL_SIZE                               0x8
#define _PWM1OFL_PWM1OFL_LENGTH                             0x8
#define _PWM1OFL_PWM1OFL_MASK                               0xFF

// Register: PWM1OFH
#define PWM1OFH PWM1OFH
extern volatile unsigned char           PWM1OFH             __at(0xD98);
#ifndef _LIB_BUILD
asm("PWM1OFH equ 0D98h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM1OFH0               :1;
        unsigned PWM1OFH1               :1;
        unsigned PWM1OFH2               :1;
        unsigned PWM1OFH3               :1;
        unsigned PWM1OFH4               :1;
        unsigned PWM1OFH5               :1;
        unsigned PWM1OFH6               :1;
        unsigned PWM1OFH7               :1;
    };
    struct {
        unsigned PWM1OFH                :8;
    };
} PWM1OFHbits_t;
extern volatile PWM1OFHbits_t PWM1OFHbits __at(0xD98);
// bitfield macros
#define _PWM1OFH_OF_POSN                                    0x0
#define _PWM1OFH_OF_POSITION                                0x0
#define _PWM1OFH_OF_SIZE                                    0x8
#define _PWM1OFH_OF_LENGTH                                  0x8
#define _PWM1OFH_OF_MASK                                    0xFF
#define _PWM1OFH_PWM1OFH0_POSN                              0x0
#define _PWM1OFH_PWM1OFH0_POSITION                          0x0
#define _PWM1OFH_PWM1OFH0_SIZE                              0x1
#define _PWM1OFH_PWM1OFH0_LENGTH                            0x1
#define _PWM1OFH_PWM1OFH0_MASK                              0x1
#define _PWM1OFH_PWM1OFH1_POSN                              0x1
#define _PWM1OFH_PWM1OFH1_POSITION                          0x1
#define _PWM1OFH_PWM1OFH1_SIZE                              0x1
#define _PWM1OFH_PWM1OFH1_LENGTH                            0x1
#define _PWM1OFH_PWM1OFH1_MASK                              0x2
#define _PWM1OFH_PWM1OFH2_POSN                              0x2
#define _PWM1OFH_PWM1OFH2_POSITION                          0x2
#define _PWM1OFH_PWM1OFH2_SIZE                              0x1
#define _PWM1OFH_PWM1OFH2_LENGTH                            0x1
#define _PWM1OFH_PWM1OFH2_MASK                              0x4
#define _PWM1OFH_PWM1OFH3_POSN                              0x3
#define _PWM1OFH_PWM1OFH3_POSITION                          0x3
#define _PWM1OFH_PWM1OFH3_SIZE                              0x1
#define _PWM1OFH_PWM1OFH3_LENGTH                            0x1
#define _PWM1OFH_PWM1OFH3_MASK                              0x8
#define _PWM1OFH_PWM1OFH4_POSN                              0x4
#define _PWM1OFH_PWM1OFH4_POSITION                          0x4
#define _PWM1OFH_PWM1OFH4_SIZE                              0x1
#define _PWM1OFH_PWM1OFH4_LENGTH                            0x1
#define _PWM1OFH_PWM1OFH4_MASK                              0x10
#define _PWM1OFH_PWM1OFH5_POSN                              0x5
#define _PWM1OFH_PWM1OFH5_POSITION                          0x5
#define _PWM1OFH_PWM1OFH5_SIZE                              0x1
#define _PWM1OFH_PWM1OFH5_LENGTH                            0x1
#define _PWM1OFH_PWM1OFH5_MASK                              0x20
#define _PWM1OFH_PWM1OFH6_POSN                              0x6
#define _PWM1OFH_PWM1OFH6_POSITION                          0x6
#define _PWM1OFH_PWM1OFH6_SIZE                              0x1
#define _PWM1OFH_PWM1OFH6_LENGTH                            0x1
#define _PWM1OFH_PWM1OFH6_MASK                              0x40
#define _PWM1OFH_PWM1OFH7_POSN                              0x7
#define _PWM1OFH_PWM1OFH7_POSITION                          0x7
#define _PWM1OFH_PWM1OFH7_SIZE                              0x1
#define _PWM1OFH_PWM1OFH7_LENGTH                            0x1
#define _PWM1OFH_PWM1OFH7_MASK                              0x80
#define _PWM1OFH_PWM1OFH_POSN                               0x0
#define _PWM1OFH_PWM1OFH_POSITION                           0x0
#define _PWM1OFH_PWM1OFH_SIZE                               0x8
#define _PWM1OFH_PWM1OFH_LENGTH                             0x8
#define _PWM1OFH_PWM1OFH_MASK                               0xFF

// Register: PWM1TMR
#define PWM1TMR PWM1TMR
extern volatile unsigned short          PWM1TMR             __at(0xD99);
#ifndef _LIB_BUILD
asm("PWM1TMR equ 0D99h");
#endif

