MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1575/mcu.h
// Register: PWM3TMRL
#define PWM3TMRL PWM3TMRL
extern volatile unsigned char           PWM3TMRL            __at(0xDB9);
#ifndef _LIB_BUILD
asm("PWM3TMRL equ 0DB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM3TMRL0              :1;
        unsigned PWM3TMRL1              :1;
        unsigned PWM3TMRL2              :1;
        unsigned PWM3TMRL3              :1;
        unsigned PWM3TMRL4              :1;
        unsigned PWM3TMRL5              :1;
        unsigned PWM3TMRL6              :1;
        unsigned PWM3TMRL7              :1;
    };
    struct {
        unsigned PWM3TMRL               :8;
    };
} PWM3TMRLbits_t;
extern volatile PWM3TMRLbits_t PWM3TMRLbits __at(0xDB9);
// bitfield macros
#define _PWM3TMRL_TMR_POSN                                  0x0
#define _PWM3TMRL_TMR_POSITION                              0x0
#define _PWM3TMRL_TMR_SIZE                                  0x8
#define _PWM3TMRL_TMR_LENGTH                                0x8
#define _PWM3TMRL_TMR_MASK                                  0xFF
#define _PWM3TMRL_PWM3TMRL0_POSN                            0x0
#define _PWM3TMRL_PWM3TMRL0_POSITION                        0x0
#define _PWM3TMRL_PWM3TMRL0_SIZE                            0x1
#define _PWM3TMRL_PWM3TMRL0_LENGTH                          0x1
#define _PWM3TMRL_PWM3TMRL0_MASK                            0x1
#define _PWM3TMRL_PWM3TMRL1_POSN                            0x1
#define _PWM3TMRL_PWM3TMRL1_POSITION                        0x1
#define _PWM3TMRL_PWM3TMRL1_SIZE                            0x1
#define _PWM3TMRL_PWM3TMRL1_LENGTH                          0x1
#define _PWM3TMRL_PWM3TMRL1_MASK                            0x2
#define _PWM3TMRL_PWM3TMRL2_POSN                            0x2
#define _PWM3TMRL_PWM3TMRL2_POSITION                        0x2
#define _PWM3TMRL_PWM3TMRL2_SIZE                            0x1
#define _PWM3TMRL_PWM3TMRL2_LENGTH                          0x1
#define _PWM3TMRL_PWM3TMRL2_MASK                            0x4
#define _PWM3TMRL_PWM3TMRL3_POSN                            0x3
#define _PWM3TMRL_PWM3TMRL3_POSITION                        0x3
#define _PWM3TMRL_PWM3TMRL3_SIZE                            0x1
#define _PWM3TMRL_PWM3TMRL3_LENGTH                          0x1
#define _PWM3TMRL_PWM3TMRL3_MASK                            0x8
#define _PWM3TMRL_PWM3TMRL4_POSN                            0x4
#define _PWM3TMRL_PWM3TMRL4_POSITION                        0x4
#define _PWM3TMRL_PWM3TMRL4_SIZE                            0x1
#define _PWM3TMRL_PWM3TMRL4_LENGTH                          0x1
#define _PWM3TMRL_PWM3TMRL4_MASK                            0x10
#define _PWM3TMRL_PWM3TMRL5_POSN                            0x5
#define _PWM3TMRL_PWM3TMRL5_POSITION                        0x5
#define _PWM3TMRL_PWM3TMRL5_SIZE                            0x1
#define _PWM3TMRL_PWM3TMRL5_LENGTH                          0x1
#define _PWM3TMRL_PWM3TMRL5_MASK                            0x20
#define _PWM3TMRL_PWM3TMRL6_POSN                            0x6
#define _PWM3TMRL_PWM3TMRL6_POSITION                        0x6
#define _PWM3TMRL_PWM3TMRL6_SIZE                            0x1
#define _PWM3TMRL_PWM3TMRL6_LENGTH                          0x1
#define _PWM3TMRL_PWM3TMRL6_MASK                            0x40
#define _PWM3TMRL_PWM3TMRL7_POSN                            0x7
#define _PWM3TMRL_PWM3TMRL7_POSITION                        0x7
#define _PWM3TMRL_PWM3TMRL7_SIZE                            0x1
#define _PWM3TMRL_PWM3TMRL7_LENGTH                          0x1
#define _PWM3TMRL_PWM3TMRL7_MASK                            0x80
#define _PWM3TMRL_PWM3TMRL_POSN                             0x0
#define _PWM3TMRL_PWM3TMRL_POSITION                         0x0
#define _PWM3TMRL_PWM3TMRL_SIZE                             0x8
#define _PWM3TMRL_PWM3TMRL_LENGTH                           0x8
#define _PWM3TMRL_PWM3TMRL_MASK                             0xFF

// Register: PWM3TMRH
#define PWM3TMRH PWM3TMRH
extern volatile unsigned char           PWM3TMRH            __at(0xDBA);
#ifndef _LIB_BUILD
asm("PWM3TMRH equ 0DBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM3TMRH0              :1;
        unsigned PWM3TMRH1              :1;
        unsigned PWM3TMRH2              :1;
        unsigned PWM3TMRH3              :1;
        unsigned PWM3TMRH4              :1;
        unsigned PWM3TMRH5              :1;
        unsigned PWM3TMRH6              :1;
        unsigned PWM3TMRH7              :1;
    };
    struct {
        unsigned PWM3TMRH               :8;
    };
} PWM3TMRHbits_t;
extern volatile PWM3TMRHbits_t PWM3TMRHbits __at(0xDBA);
// bitfield macros
#define _PWM3TMRH_TMR_POSN                                  0x0
#define _PWM3TMRH_TMR_POSITION                              0x0
#define _PWM3TMRH_TMR_SIZE                                  0x8
#define _PWM3TMRH_TMR_LENGTH                                0x8
#define _PWM3TMRH_TMR_MASK                                  0xFF
#define _PWM3TMRH_PWM3TMRH0_POSN                            0x0
#define _PWM3TMRH_PWM3TMRH0_POSITION                        0x0
#define _PWM3TMRH_PWM3TMRH0_SIZE                            0x1
#define _PWM3TMRH_PWM3TMRH0_LENGTH                          0x1
#define _PWM3TMRH_PWM3TMRH0_MASK                            0x1
#define _PWM3TMRH_PWM3TMRH1_POSN                            0x1
#define _PWM3TMRH_PWM3TMRH1_POSITION                        0x1
#define _PWM3TMRH_PWM3TMRH1_SIZE                            0x1
#define _PWM3TMRH_PWM3TMRH1_LENGTH                          0x1
#define _PWM3TMRH_PWM3TMRH1_MASK                            0x2
#define _PWM3TMRH_PWM3TMRH2_POSN                            0x2
#define _PWM3TMRH_PWM3TMRH2_POSITION                        0x2
#define _PWM3TMRH_PWM3TMRH2_SIZE                            0x1
#define _PWM3TMRH_PWM3TMRH2_LENGTH                          0x1
#define _PWM3TMRH_PWM3TMRH2_MASK                            0x4
#define _PWM3TMRH_PWM3TMRH3_POSN                            0x3
#define _PWM3TMRH_PWM3TMRH3_POSITION                        0x3
#define _PWM3TMRH_PWM3TMRH3_SIZE                            0x1
#define _PWM3TMRH_PWM3TMRH3_LENGTH                          0x1
#define _PWM3TMRH_PWM3TMRH3_MASK                            0x8
#define _PWM3TMRH_PWM3TMRH4_POSN                            0x4
#define _PWM3TMRH_PWM3TMRH4_POSITION                        0x4
#define _PWM3TMRH_PWM3TMRH4_SIZE                            0x1
#define _PWM3TMRH_PWM3TMRH4_LENGTH                          0x1
#define _PWM3TMRH_PWM3TMRH4_MASK                            0x10
#define _PWM3TMRH_PWM3TMRH5_POSN                            0x5
#define _PWM3TMRH_PWM3TMRH5_POSITION                        0x5
#define _PWM3TMRH_PWM3TMRH5_SIZE                            0x1
#define _PWM3TMRH_PWM3TMRH5_LENGTH                          0x1
#define _PWM3TMRH_PWM3TMRH5_MASK                            0x20
#define _PWM3TMRH_PWM3TMRH6_POSN                            0x6
#define _PWM3TMRH_PWM3TMRH6_POSITION                        0x6
#define _PWM3TMRH_PWM3TMRH6_SIZE                            0x1
#define _PWM3TMRH_PWM3TMRH6_LENGTH                          0x1
#define _PWM3TMRH_PWM3TMRH6_MASK                            0x40
#define _PWM3TMRH_PWM3TMRH7_POSN                            0x7
#define _PWM3TMRH_PWM3TMRH7_POSITION                        0x7
#define _PWM3TMRH_PWM3TMRH7_SIZE                            0x1
#define _PWM3TMRH_PWM3TMRH7_LENGTH                          0x1
#define _PWM3TMRH_PWM3TMRH7_MASK                            0x80
#define _PWM3TMRH_PWM3TMRH_POSN                             0x0
#define _PWM3TMRH_PWM3TMRH_POSITION                         0x0
#define _PWM3TMRH_PWM3TMRH_SIZE                             0x8
#define _PWM3TMRH_PWM3TMRH_LENGTH                           0x8
#define _PWM3TMRH_PWM3TMRH_MASK                             0xFF

// Register: PWM3CON
#define PWM3CON PWM3CON
extern volatile unsigned char           PWM3CON             __at(0xDBB);
#ifndef _LIB_BUILD
asm("PWM3CON equ 0DBBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned MODE                   :2;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned OE                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM3MODE0              :1;
        unsigned PWM3MODE1              :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM3MODE               :2;
        unsigned PWM3POL                :1;
        unsigned PWM3OUT                :1;
        unsigned PWM3OE                 :1;
        unsigned PWM3EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
} PWM3CONbits_t;
extern volatile PWM3CONbits_t PWM3CONbits __at(0xDBB);
// bitfield macros
#define _PWM3CON_MODE_POSN                                  0x2
#define _PWM3CON_MODE_POSITION                              0x2
#define _PWM3CON_MODE_SIZE                                  0x2
#define _PWM3CON_MODE_LENGTH                                0x2
#define _PWM3CON_MODE_MASK                                  0xC
#define _PWM3CON_POL_POSN                                   0x4
#define _PWM3CON_POL_POSITION                               0x4
#define _PWM3CON_POL_SIZE                                   0x1
#define _PWM3CON_POL_LENGTH                                 0x1
#define _PWM3CON_POL_MASK                                   0x10
#define _PWM3CON_OUT_POSN                                   0x5
#define _PWM3CON_OUT_POSITION                               0x5
#define _PWM3CON_OUT_SIZE                                   0x1
#define _PWM3CON_OUT_LENGTH                                 0x1
#define _PWM3CON_OUT_MASK                                   0x20
#define _PWM3CON_OE_POSN                                    0x6
#define _PWM3CON_OE_POSITION                                0x6
#define _PWM3CON_OE_SIZE                                    0x1
#define _PWM3CON_OE_LENGTH                                  0x1
#define _PWM3CON_OE_MASK                                    0x40
#define _PWM3CON_EN_POSN                                    0x7
#define _PWM3CON_EN_POSITION                                0x7
#define _PWM3CON_EN_SIZE                                    0x1
#define _PWM3CON_EN_LENGTH                                  0x1
#define _PWM3CON_EN_MASK                                    0x80
#define _PWM3CON_PWM3MODE0_POSN                             0x2
#define _PWM3CON_PWM3MODE0_POSITION                         0x2
#define _PWM3CON_PWM3MODE0_SIZE                             0x1
#define _PWM3CON_PWM3MODE0_LENGTH                           0x1
#define _PWM3CON_PWM3MODE0_MASK                             0x4
#define _PWM3CON_PWM3MODE1_POSN                             0x3
#define _PWM3CON_PWM3MODE1_POSITION                         0x3
#define _PWM3CON_PWM3MODE1_SIZE                             0x1
#define _PWM3CON_PWM3MODE1_LENGTH                           0x1
#define _PWM3CON_PWM3MODE1_MASK                             0x8
#define _PWM3CON_PWM3MODE_POSN                              0x2
#define _PWM3CON_PWM3MODE_POSITION                          0x2
#define _PWM3CON_PWM3MODE_SIZE                              0x2
#define _PWM3CON_PWM3MODE_LENGTH                            0x2
#define _PWM3CON_PWM3MODE_MASK                              0xC
#define _PWM3CON_PWM3POL_POSN                               0x4
#define _PWM3CON_PWM3POL_POSITION                           0x4
#define _PWM3CON_PWM3POL_SIZE                               0x1
#define _PWM3CON_PWM3POL_LENGTH                             0x1
#define _PWM3CON_PWM3POL_MASK                               0x10
#define _PWM3CON_PWM3OUT_POSN                               0x5
#define _PWM3CON_PWM3OUT_POSITION                           0x5
#define _PWM3CON_PWM3OUT_SIZE                               0x1
#define _PWM3CON_PWM3OUT_LENGTH                             0x1
#define _PWM3CON_PWM3OUT_MASK                               0x20
#define _PWM3CON_PWM3OE_POSN                                0x6
#define _PWM3CON_PWM3OE_POSITION                            0x6
#define _PWM3CON_PWM3OE_SIZE                                0x1
#define _PWM3CON_PWM3OE_LENGTH                              0x1
#define _PWM3CON_PWM3OE_MASK                                0x40
#define _PWM3CON_PWM3EN_POSN                                0x7
#define _PWM3CON_PWM3EN_POSITION                            0x7
#define _PWM3CON_PWM3EN_SIZE                                0x1
#define _PWM3CON_PWM3EN_LENGTH                              0x1
#define _PWM3CON_PWM3EN_MASK                                0x80
#define _PWM3CON_MODE0_POSN                                 0x2
#define _PWM3CON_MODE0_POSITION                             0x2
#define _PWM3CON_MODE0_SIZE                                 0x1
#define _PWM3CON_MODE0_LENGTH                               0x1
#define _PWM3CON_MODE0_MASK                                 0x4
#define _PWM3CON_MODE1_POSN                                 0x3
#define _PWM3CON_MODE1_POSITION                             0x3
#define _PWM3CON_MODE1_SIZE                                 0x1
#define _PWM3CON_MODE1_LENGTH                               0x1
#define _PWM3CON_MODE1_MASK                                 0x8

// Register: PWM3INTE
#define PWM3INTE PWM3INTE
extern volatile unsigned char           PWM3INTE            __at(0xDBC);
#ifndef _LIB_BUILD
asm("PWM3INTE equ 0DBCh");
#endif
// aliases
extern volatile unsigned char           PWM3INTCON          __at(0xDBC);
#ifndef _LIB_BUILD
asm("PWM3INTCON equ 0DBCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM3PRIE               :1;
        unsigned PWM3DCIE               :1;
        unsigned PWM3PHIE               :1;
        unsigned PWM3OFIE               :1;
    };
} PWM3INTEbits_t;
